misteraddons/Reflex-Adapt/arduino/hardware/misteraddons/avr/boards.txt
reflex.name=Reflex Adapt
reflex.vid.0=0x2341
reflex.pid.0=0x0036
reflex.vid.1=0x2341
reflex.pid.1=0x8036
reflex.vid.2=0x2A03
reflex.pid.2=0x0036
reflex.vid.3=0x2A03
reflex.pid.3=0x8036
reflex.vid.4=0x16D0
reflex.pid.4=0x127E
reflex.upload_port.0.vid=0x2341
reflex.upload_port.0.pid=0x0036
reflex.upload_port.1.vid=0x2341
reflex.upload_port.1.pid=0x8036
reflex.upload_port.2.vid=0x2A03
reflex.upload_port.2.pid=0x0036
reflex.upload_port.3.vid=0x2A03
reflex.upload_port.3.pid=0x8036
reflex.upload_port.4.vid=0x16D0
reflex.upload_port.4.pid=0x127E
reflex.upload_port.5.board=leonardo

reflex.upload.tool=arduino:avrdude
reflex.upload.tool.default=arduino:avrdude
reflex.upload.tool.network=arduino_ota
reflex.upload.protocol=avr109
reflex.upload.maximum_size=28672
reflex.upload.maximum_data_size=2560
reflex.upload.speed=57600
reflex.upload.disable_flushing=true
reflex.upload.use_1200bps_touch=true
reflex.upload.wait_for_upload_port=true

reflex.bootloader.tool=arduino:avrdude
reflex.bootloader.tool.default=arduino:avrdude
reflex.bootloader.low_fuses=0xff
reflex.bootloader.high_fuses=0xd8
reflex.bootloader.extended_fuses=0xcb
#reflex.bootloader.file=caterina/Caterina-Leonardo.hex
reflex.bootloader.unlock_bits=0x3F
reflex.bootloader.lock_bits=0x2F

reflex.build.mcu=atmega32u4
reflex.build.f_cpu=16000000L
reflex.build.vid=0x16D0
reflex.build.pid=0x127E
reflex.build.usb_product="Reflex Adapt"
reflex.build.board=AVR_LEONARDO
reflex.build.core=arduino:arduino
reflex.build.variant=arduino:leonardo
reflex.build.extra_flags={build.usb_flags}

##############################################################

reflexswitch.name=Reflex Adapt Switch
reflexswitch.vid.0=0x2341
reflexswitch.pid.0=0x0036
reflexswitch.vid.1=0x2341
reflexswitch.pid.1=0x8036
reflexswitch.vid.2=0x2A03
reflexswitch.pid.2=0x0036
reflexswitch.vid.3=0x2A03
reflexswitch.pid.3=0x8036
reflexswitch.vid.4=0x16D0
reflexswitch.pid.4=0x127E
reflexswitch.upload_port.0.vid=0x2341
reflexswitch.upload_port.0.pid=0x0036
reflexswitch.upload_port.1.vid=0x2341
reflexswitch.upload_port.1.pid=0x8036
reflexswitch.upload_port.2.vid=0x2A03
reflexswitch.upload_port.2.pid=0x0036
reflexswitch.upload_port.3.vid=0x2A03
reflexswitch.upload_port.3.pid=0x8036
reflexswitch.upload_port.4.vid=0x16D0
reflexswitch.upload_port.4.pid=0x127E
reflexswitch.upload_port.5.board=leonardo

reflexswitch.upload.tool=arduino:avrdude
reflexswitch.upload.tool.default=arduino:avrdude
reflexswitch.upload.tool.network=arduino_ota
reflexswitch.upload.protocol=avr109
reflexswitch.upload.maximum_size=28672
reflexswitch.upload.maximum_data_size=2560
reflexswitch.upload.speed=57600
reflexswitch.upload.disable_flushing=true
reflexswitch.upload.use_1200bps_touch=true
reflexswitch.upload.wait_for_upload_port=true

reflexswitch.bootloader.tool=arduino:avrdude
reflexswitch.bootloader.tool.default=arduino:avrdude
reflexswitch.bootloader.low_fuses=0xff
reflexswitch.bootloader.high_fuses=0xd8
reflexswitch.bootloader.extended_fuses=0xcb
#reflexswitch.bootloader.file=caterina/Caterina-Leonardo.hex
reflexswitch.bootloader.unlock_bits=0x3F
reflexswitch.bootloader.lock_bits=0x2F

reflexswitch.build.mcu=atmega32u4
reflexswitch.build.f_cpu=16000000L
reflexswitch.build.vid=0x0F0D
reflexswitch.build.pid=0x0092
reflexswitch.build.usb_product="POKKEN CONTROLLER"
reflexswitch.build.board=AVR_LEONARDO
reflexswitch.build.core=arduino:arduino
reflexswitch.build.variant=arduino:leonardo
reflexswitch.build.extra_flags={build.usb_flags}
